In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
from sklearn.datasets import fetch_california_housing
import os

print("✅ All libraries imported!")

✅ All libraries imported!

In [3]:
# Create folders
os.makedirs('datasets', exist_ok=True)
os.makedirs('Example1_Titanic', exist_ok=True)
os.makedirs('Example2_Housing', exist_ok=True)
os.makedirs('images', exist_ok=True)

print("✅ Folders created!")

✅ Folders created!

In [5]:
# Download Titanic dataset
titanic = sns.load_dataset('titanic')
titanic.to_csv('datasets/titanic.csv', index=False)
print(f"✅ Titanic downloaded: {titanic.shape[0]} rows × {titanic.shape[1]} columns")
titanic.head()

✅ Titanic downloaded: 891 rows × 15 columns

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [7]:
# Download Housing dataset
housing = fetch_california_housing(as_frame=True)
housing_df = housing.frame
housing_df.to_csv('datasets/housing.csv', index=False)
print(f"✅ Housing downloaded: {housing_df.shape[0]} rows × {housing_df.shape[1]} columns")
housing_df.head()

✅ Housing downloaded: 20640 rows × 9 columns

,MedInc,HouseAge,AveRooms,AveBedrms,Population,AveOccup,Latitude,Longitude,MedHouseVal
0,8.3252,41.0,6.984127,1.023810,322.0,2.555556,37.88,-122.23,4.526
1,8.3014,21.0,6.238137,0.971880,2401.0,2.109842,37.86,-122.22,3.585
2,7.2574,52.0,8.288136,1.073446,496.0,2.802260,37.85,-122.24,3.521
3,5.6431,52.0,5.817352,1.073059,558.0,2.547945,37.85,-122.25,3.413
4,3.8462,52.0,6.281853,1.081081,565.0,2.181467,37.85,-122.25,3.422